app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    CacheStatistic.create_from_file('app/assets/server_traffic.log', 10)
    @courses = Course.all